#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_cloudwatch_log_group.VotingAppApi_post_requestChoices_0_CloudwatchLogGroup_D90384E8: Refreshing state... [id=/aws/lambda/post_requestChoices_-0-c8d86128]
aws_iam_role_policy.VotingAppApi_post_selectWinner_0_IamRolePolicy_B53A9334: Refreshing state... [id=terraform-20231221213844334200000001:terraform-20231221213844554800000005]
aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard_0_IamRolePolicyAttachment_99497C00: Refreshing state... [id=terraform-20231221213844432600000003-20231221213844718800000009]
aws_iam_role_policy.VotingAppApi_get_leaderboard_0_IamRolePolicy_270C27DF: Refreshing state... [id=terraform-20231221213844432600000003:terraform-20231221213844639600000008]
aws_iam_role.VotingAppApi_get_leaderboard_0_IamRole_9998B840: Refreshing state... [id=terraform-20231221213844432600000003]
aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices_0_IamRolePolicyAttachment_0CB6C95A: Refreshing state... [id=terraform-20231221213844335100000002-20231221213844572900000006]
aws_cloudwatch_log_group.VotingAppApi_post_selectWinner_0_CloudwatchLogGroup_7462E4AE: Refreshing state... [id=/aws/lambda/post_selectWinner_-0-c8c0c66e]
aws_lambda_function.VotingAppApi_post_requestChoices_0_003C4BE4: Refreshing state... [id=post_requestChoices_-0-c8d86128]
aws_s3_object.VotingAppApi_post_requestChoices_0_S3Object_0F32C7ED: Refreshing state... [id=asset.c8d86128c81e505aae639175f68a6fc452d15dc1e7.63cd2da98675ab88eaacc9220ad7a5e6.zip]
aws_lambda_function.VotingAppApi_post_selectWinner_0_BCE17A05: Refreshing state... [id=post_selectWinner_-0-c8c0c66e]
aws_iam_role_policy.VotingAppApi_post_requestChoices_0_IamRolePolicy_F97AD8B2: Refreshing state... [id=terraform-20231221213844335100000002:terraform-20231221213844527000000004]
aws_cloudwatch_log_group.VotingAppApi_get_leaderboard_0_CloudwatchLogGroup_0B6BAC75: Refreshing state... [id=/aws/lambda/get_leaderboard_-0-c8adc0c6]
aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner_0_IamRolePolicyAttachment_742D3FCD: Refreshing state... [id=terraform-20231221213844334200000001-20231221213844588500000007]
aws_s3_object.VotingAppApi_post_selectWinner_0_S3Object_877CE186: Refreshing state... [id=asset.c8c0c66e379f219d8dcc336e3745cb403950d3def2.3ec2ec6d5f3bdba3150185cee1d1cfda.zip]
aws_iam_role.VotingAppApi_post_requestChoices_0_IamRole_B969B421: Refreshing state... [id=terraform-20231221213844335100000002]
aws_lambda_function.VotingAppApi_get_leaderboard_0_72483B61: Refreshing state... [id=get_leaderboard_-0-c8adc0c6]
aws_s3_object.VotingAppApi_get_leaderboard_0_S3Object_04562587: Refreshing state... [id=asset.c8adc0c6029160df0b12001870df80f2fc8316f4b9.e4dfec769bcf7b35020cea6414eda1d5.zip]
aws_iam_role.VotingAppApi_post_selectWinner_0_IamRole_A3E67832: Refreshing state... [id=terraform-20231221213844334200000001]
aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD: Refreshing state... [id=DynamoDBTableAws-4b65a10e]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_cloudwatch_log_group.InitializeTable_Function_CloudwatchLogGroup_E746307D: Refreshing state... [id=/aws/lambda/Function-c8e7055b]
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
data.aws_region.Region: Reading...
data.aws_region.Region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.account: Reading...
data.aws_caller_identity.account: Read complete after 0s [id=223316951128]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=f9yi5t9zj2]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285: Refreshing state... [id=/static/css/main.bc8dc0a9.css]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F: Refreshing state... [id=/static/js/main.f35fcf80.js]
aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B: Refreshing state... [id=/static/css/main.bc8dc0a9.css.map]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1: Refreshing state... [id=/static/js/main.f35fcf80.js.LICENSE.txt]
aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9: Refreshing state... [id=/static/js/main.f35fcf80.js.map]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=2zeqei]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-f9yi5t9zj2-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.75b1a0086b203b3eeefa52f71b072b2e.zip]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9 has been deleted
  - resource "aws_cloudfront_distribution" "cloudWebsite_Distribution_083B5AF9" {
      - arn                            = "arn:aws:cloudfront::223316951128:distribution/E1QUV69RQ9ODON" -> null
      - domain_name                    = "d150bm8l5c4qqp.cloudfront.net" -> null
        id                             = "E1QUV69RQ9ODON"
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD has been deleted
  - resource "aws_dynamodb_table" "VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD" {
      - arn                         = "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e" -> null
        id                          = "DynamoDBTableAws-4b65a10e"
      - name                        = "DynamoDBTableAws-4b65a10e" -> null
        tags                        = {}
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355 has been deleted
  - resource "aws_s3_bucket" "cloudWebsite_WebsiteBucket_EB03D355" {
      - arn                         = "arn:aws:s3:::cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket                      = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_regional_domain_name = "cloud-website-c8e58765-20230803215115368500000001.s3.amazonaws.com" -> null
      - id                          = "cloud-website-c8e58765-20230803215115368500000001" -> null
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudWebsite_AllowDistributionReadOnly_89DC4FD0" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 must be replaced
+/- resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      ~ created_date  = "2023-12-21T21:38:59Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:223316951128:f9yi5t9zj2/" -> (known after apply)
      ~ id            = "2zeqei" -> (known after apply)
      ~ invoke_url    = "https://f9yi5t9zj2.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "402d8229394baaa2921ca3a5bd2fa37dce3b10267fc371e77d6d8f7f640f86b4" -> "3c952868bcb9d27ee0cf6c94192b5a09ab2b868344027fa17029521f3eb8cf7f"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98 will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "VotingAppApi_api_CB41EC98" {
      ~ body                         = jsonencode(
          ~ {
              ~ paths   = {
                  ~ "/leaderboard"    = {
                      ~ get = {
                          ~ x-amazon-apigateway-integration = {
                              ~ uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard_-0-c8adc0c6/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard0-c8bf3988/invocations"
                                # (5 unchanged attributes hidden)
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                  ~ "/requestChoices" = {
                      ~ post = {
                          ~ x-amazon-apigateway-integration = {
                              ~ uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices_-0-c8d86128/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices0-c8820ba5/invocations"
                                # (5 unchanged attributes hidden)
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                  ~ "/selectWinner"   = {
                      ~ post = {
                          ~ x-amazon-apigateway-integration = {
                              ~ uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner_-0-c8c0c66e/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner0-c8d65bd1/invocations"
                                # (5 unchanged attributes hidden)
                            }
                            # (3 unchanged attributes hidden)
                        }
                    }
                    # (1 unchanged attribute hidden)
                }
                # (1 unchanged attribute hidden)
            }
        )
        id                           = "f9yi5t9zj2"
        name                         = "api-c8bc2868"
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be updated in-place
  ~ resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      ~ deployment_id         = "2zeqei" -> (known after apply)
        id                    = "ags-f9yi5t9zj2-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9 will be created
  + resource "aws_cloudfront_distribution" "cloudWebsite_Distribution_083B5AF9" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "s3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E1J2GO7P2VQ2EZ"
          + origin_id                = "s3Origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudwatch_log_group.VotingAppApi_get_leaderboard0_CloudwatchLogGroup_80A5B81E will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_get_leaderboard0_CloudwatchLogGroup_80A5B81E" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/get_leaderboard0-c8bf3988"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_get_leaderboard_0_CloudwatchLogGroup_0B6BAC75 will be destroyed
  # (because aws_cloudwatch_log_group.VotingAppApi_get_leaderboard_0_CloudwatchLogGroup_0B6BAC75 is not in configuration)
  - resource "aws_cloudwatch_log_group" "VotingAppApi_get_leaderboard_0_CloudwatchLogGroup_0B6BAC75" {
      - arn               = "arn:aws:logs:us-east-1:223316951128:log-group:/aws/lambda/get_leaderboard_-0-c8adc0c6" -> null
      - id                = "/aws/lambda/get_leaderboard_-0-c8adc0c6" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/get_leaderboard_-0-c8adc0c6" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_cloudwatch_log_group.VotingAppApi_post_requestChoices0_CloudwatchLogGroup_679E4CF2 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_post_requestChoices0_CloudwatchLogGroup_679E4CF2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/post_requestChoices0-c8820ba5"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_post_requestChoices_0_CloudwatchLogGroup_D90384E8 will be destroyed
  # (because aws_cloudwatch_log_group.VotingAppApi_post_requestChoices_0_CloudwatchLogGroup_D90384E8 is not in configuration)
  - resource "aws_cloudwatch_log_group" "VotingAppApi_post_requestChoices_0_CloudwatchLogGroup_D90384E8" {
      - arn               = "arn:aws:logs:us-east-1:223316951128:log-group:/aws/lambda/post_requestChoices_-0-c8d86128" -> null
      - id                = "/aws/lambda/post_requestChoices_-0-c8d86128" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/post_requestChoices_-0-c8d86128" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_cloudwatch_log_group.VotingAppApi_post_selectWinner0_CloudwatchLogGroup_FF958712 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppApi_post_selectWinner0_CloudwatchLogGroup_FF958712" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/post_selectWinner0-c8d65bd1"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppApi_post_selectWinner_0_CloudwatchLogGroup_7462E4AE will be destroyed
  # (because aws_cloudwatch_log_group.VotingAppApi_post_selectWinner_0_CloudwatchLogGroup_7462E4AE is not in configuration)
  - resource "aws_cloudwatch_log_group" "VotingAppApi_post_selectWinner_0_CloudwatchLogGroup_7462E4AE" {
      - arn               = "arn:aws:logs:us-east-1:223316951128:log-group:/aws/lambda/post_selectWinner_-0-c8c0c66e" -> null
      - id                = "/aws/lambda/post_selectWinner_-0-c8c0c66e" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/post_selectWinner_-0-c8c0c66e" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_dynamodb_table.VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD will be created
  + resource "aws_dynamodb_table" "VotingAppStore_Entries_DynamoDBTableAws_tfawsdynamodbTableDynamodbTable_894280AD" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "DynamoDBTableAws-4b65a10e"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Name"
          + type = "S"
        }
    }

  # aws_iam_role.VotingAppApi_get_leaderboard0_IamRole_DE30BD64 will be created
  + resource "aws_iam_role" "VotingAppApi_get_leaderboard0_IamRole_DE30BD64" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_get_leaderboard_0_IamRole_9998B840 will be destroyed
  # (because aws_iam_role.VotingAppApi_get_leaderboard_0_IamRole_9998B840 is not in configuration)
  - resource "aws_iam_role" "VotingAppApi_get_leaderboard_0_IamRole_9998B840" {
      - arn                   = "arn:aws:iam::223316951128:role/terraform-20231221213844432600000003" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-21T21:38:44Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20231221213844432600000003" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20231221213844432600000003" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATH7V2IBMPX3JD2FQR" -> null

      - inline_policy {
          - name   = "terraform-20231221213844639600000008" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "dynamodb:Scan",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.VotingAppApi_post_requestChoices0_IamRole_22F6E9E7 will be created
  + resource "aws_iam_role" "VotingAppApi_post_requestChoices0_IamRole_22F6E9E7" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_post_requestChoices_0_IamRole_B969B421 will be destroyed
  # (because aws_iam_role.VotingAppApi_post_requestChoices_0_IamRole_B969B421 is not in configuration)
  - resource "aws_iam_role" "VotingAppApi_post_requestChoices_0_IamRole_B969B421" {
      - arn                   = "arn:aws:iam::223316951128:role/terraform-20231221213844335100000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-21T21:38:44Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20231221213844335100000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20231221213844335100000002" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATH7V2IBMNMYAYLOZE" -> null

      - inline_policy {
          - name   = "terraform-20231221213844527000000004" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "dynamodb:Scan",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.VotingAppApi_post_selectWinner0_IamRole_3824DF8A will be created
  + resource "aws_iam_role" "VotingAppApi_post_selectWinner0_IamRole_3824DF8A" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.VotingAppApi_post_selectWinner_0_IamRole_A3E67832 will be destroyed
  # (because aws_iam_role.VotingAppApi_post_selectWinner_0_IamRole_A3E67832 is not in configuration)
  - resource "aws_iam_role" "VotingAppApi_post_selectWinner_0_IamRole_A3E67832" {
      - arn                   = "arn:aws:iam::223316951128:role/terraform-20231221213844334200000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-21T21:38:44Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20231221213844334200000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20231221213844334200000001" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATH7V2IBMHIU7A2CU2" -> null

      - inline_policy {
          - name   = "terraform-20231221213844554800000005" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "dynamodb:PutItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:Scan",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519 will be updated in-place
  ~ resource "aws_iam_role_policy" "InitializeTable_Function_IamRolePolicy_2AD89519" {
        id          = "terraform-20230727202411672600000001:terraform-20230727202424567600000008"
        name        = "terraform-20230727202424567600000008"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0 will be created
  + resource "aws_iam_role_policy" "VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_get_leaderboard_0_IamRolePolicy_270C27DF will be destroyed
  # (because aws_iam_role_policy.VotingAppApi_get_leaderboard_0_IamRolePolicy_270C27DF is not in configuration)
  - resource "aws_iam_role_policy" "VotingAppApi_get_leaderboard_0_IamRolePolicy_270C27DF" {
      - id          = "terraform-20231221213844432600000003:terraform-20231221213844639600000008" -> null
      - name        = "terraform-20231221213844639600000008" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "terraform-20231221213844432600000003" -> null
    }

  # aws_iam_role_policy.VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D will be created
  + resource "aws_iam_role_policy" "VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_post_requestChoices_0_IamRolePolicy_F97AD8B2 will be destroyed
  # (because aws_iam_role_policy.VotingAppApi_post_requestChoices_0_IamRolePolicy_F97AD8B2 is not in configuration)
  - resource "aws_iam_role_policy" "VotingAppApi_post_requestChoices_0_IamRolePolicy_F97AD8B2" {
      - id          = "terraform-20231221213844335100000002:terraform-20231221213844527000000004" -> null
      - name        = "terraform-20231221213844527000000004" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "terraform-20231221213844335100000002" -> null
    }

  # aws_iam_role_policy.VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66 will be created
  + resource "aws_iam_role_policy" "VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_post_selectWinner_0_IamRolePolicy_B53A9334 will be destroyed
  # (because aws_iam_role_policy.VotingAppApi_post_selectWinner_0_IamRolePolicy_B53A9334 is not in configuration)
  - resource "aws_iam_role_policy" "VotingAppApi_post_selectWinner_0_IamRolePolicy_B53A9334" {
      - id          = "terraform-20231221213844334200000001:terraform-20231221213844554800000005" -> null
      - name        = "terraform-20231221213844554800000005" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/DynamoDBTableAws-4b65a10e",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "terraform-20231221213844334200000001" -> null
    }

  # aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard0_IamRolePolicyAttachment_7BB9531C will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_get_leaderboard0_IamRolePolicyAttachment_7BB9531C" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard_0_IamRolePolicyAttachment_99497C00 will be destroyed
  # (because aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard_0_IamRolePolicyAttachment_99497C00 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "VotingAppApi_get_leaderboard_0_IamRolePolicyAttachment_99497C00" {
      - id         = "terraform-20231221213844432600000003-20231221213844718800000009" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "terraform-20231221213844432600000003" -> null
    }

  # aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices0_IamRolePolicyAttachment_E91C632D will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_post_requestChoices0_IamRolePolicyAttachment_E91C632D" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices_0_IamRolePolicyAttachment_0CB6C95A will be destroyed
  # (because aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices_0_IamRolePolicyAttachment_0CB6C95A is not in configuration)
  - resource "aws_iam_role_policy_attachment" "VotingAppApi_post_requestChoices_0_IamRolePolicyAttachment_0CB6C95A" {
      - id         = "terraform-20231221213844335100000002-20231221213844572900000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "terraform-20231221213844335100000002" -> null
    }

  # aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner0_IamRolePolicyAttachment_A11AE727 will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_post_selectWinner0_IamRolePolicyAttachment_A11AE727" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner_0_IamRolePolicyAttachment_742D3FCD will be destroyed
  # (because aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner_0_IamRolePolicyAttachment_742D3FCD is not in configuration)
  - resource "aws_iam_role_policy_attachment" "VotingAppApi_post_selectWinner_0_IamRolePolicyAttachment_742D3FCD" {
      - id         = "terraform-20231221213844334200000001-20231221213844588500000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "terraform-20231221213844334200000001" -> null
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-12-21T21:38:44.805+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:22/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.75b1a0086b203b3eeefa52f71b072b2e.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip"
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_get_leaderboard0_6A571716 will be created
  + resource "aws_lambda_function" "VotingAppApi_get_leaderboard0_6A571716" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "get_leaderboard0-c8bf3988"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + s3_bucket                      = "code-c84a50b1-20230727202411678600000003"
      + s3_key                         = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "NODE_OPTIONS"               = "--enable-source-maps"
              + "WING_FUNCTION_NAME"         = "get_leaderboard0-c8bf3988"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_get_leaderboard_0_72483B61 will be destroyed
  # (because aws_lambda_function.VotingAppApi_get_leaderboard_0_72483B61 is not in configuration)
  - resource "aws_lambda_function" "VotingAppApi_get_leaderboard_0_72483B61" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard_-0-c8adc0c6" -> null
      - function_name                  = "get_leaderboard_-0-c8adc0c6" -> null
      - handler                        = "index.handler" -> null
      - id                             = "get_leaderboard_-0-c8adc0c6" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard_-0-c8adc0c6/invocations" -> null
      - last_modified                  = "2023-12-21T21:38:59.830+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard_-0-c8adc0c6:1" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard_-0-c8adc0c6:1/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::223316951128:role/terraform-20231221213844432600000003" -> null
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "code-c84a50b1-20230727202411678600000003" -> null
      - s3_key                         = "asset.c8adc0c6029160df0b12001870df80f2fc8316f4b9.e4dfec769bcf7b35020cea6414eda1d5.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "lxE1lceWN521BJWDiwbeIpmolNbc2ZD0r2O/JURfIzQ=" -> null
      - source_code_size               = 529625 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "NODE_OPTIONS"               = "--enable-source-maps"
              - "WING_FUNCTION_NAME"         = "get_leaderboard_-0-c8adc0c6"
              - "WING_TARGET"                = "tf-aws"
              - "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.VotingAppApi_post_requestChoices0_78C94EF5 will be created
  + resource "aws_lambda_function" "VotingAppApi_post_requestChoices0_78C94EF5" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "post_requestChoices0-c8820ba5"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + s3_bucket                      = "code-c84a50b1-20230727202411678600000003"
      + s3_key                         = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "NODE_OPTIONS"               = "--enable-source-maps"
              + "WING_FUNCTION_NAME"         = "post_requestChoices0-c8820ba5"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_post_requestChoices_0_003C4BE4 will be destroyed
  # (because aws_lambda_function.VotingAppApi_post_requestChoices_0_003C4BE4 is not in configuration)
  - resource "aws_lambda_function" "VotingAppApi_post_requestChoices_0_003C4BE4" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices_-0-c8d86128" -> null
      - function_name                  = "post_requestChoices_-0-c8d86128" -> null
      - handler                        = "index.handler" -> null
      - id                             = "post_requestChoices_-0-c8d86128" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices_-0-c8d86128/invocations" -> null
      - last_modified                  = "2023-12-21T21:38:59.827+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices_-0-c8d86128:1" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices_-0-c8d86128:1/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::223316951128:role/terraform-20231221213844335100000002" -> null
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "code-c84a50b1-20230727202411678600000003" -> null
      - s3_key                         = "asset.c8d86128c81e505aae639175f68a6fc452d15dc1e7.63cd2da98675ab88eaacc9220ad7a5e6.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "JBMaqquMtV/nJ2U+RIaenCorIYKgtotEnHx8by5RtWg=" -> null
      - source_code_size               = 529682 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "NODE_OPTIONS"               = "--enable-source-maps"
              - "WING_FUNCTION_NAME"         = "post_requestChoices_-0-c8d86128"
              - "WING_TARGET"                = "tf-aws"
              - "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.VotingAppApi_post_selectWinner0_B484847F will be created
  + resource "aws_lambda_function" "VotingAppApi_post_selectWinner0_B484847F" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "post_selectWinner0-c8d65bd1"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + s3_bucket                      = "code-c84a50b1-20230727202411678600000003"
      + s3_key                         = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "NODE_OPTIONS"               = "--enable-source-maps"
              + "WING_FUNCTION_NAME"         = "post_selectWinner0-c8d65bd1"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.VotingAppApi_post_selectWinner_0_BCE17A05 will be destroyed
  # (because aws_lambda_function.VotingAppApi_post_selectWinner_0_BCE17A05 is not in configuration)
  - resource "aws_lambda_function" "VotingAppApi_post_selectWinner_0_BCE17A05" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner_-0-c8c0c66e" -> null
      - function_name                  = "post_selectWinner_-0-c8c0c66e" -> null
      - handler                        = "index.handler" -> null
      - id                             = "post_selectWinner_-0-c8c0c66e" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner_-0-c8c0c66e/invocations" -> null
      - last_modified                  = "2023-12-21T21:38:59.830+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner_-0-c8c0c66e:1" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner_-0-c8c0c66e:1/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::223316951128:role/terraform-20231221213844334200000001" -> null
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "code-c84a50b1-20230727202411678600000003" -> null
      - s3_key                         = "asset.c8c0c66e379f219d8dcc336e3745cb403950d3def2.3ec2ec6d5f3bdba3150185cee1d1cfda.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "U38TEq2gQRIF3PBm8KysUMc+qk/Tw0dECyXGNIPgJDA=" -> null
      - source_code_size               = 530192 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "NODE_OPTIONS"               = "--enable-source-maps"
              - "WING_FUNCTION_NAME"         = "post_selectWinner_-0-c8c0c66e"
              - "WING_TARGET"                = "tf-aws"
              - "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"DynamoDBTableAws-4b65a10e\""
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504 must be replaced
-/+ resource "aws_lambda_permission" "VotingAppApi_api_permission-GET-5969f3af_56B4A504" {
      ~ function_name       = "get_leaderboard_-0-c8adc0c6" -> "get_leaderboard0-c8bf3988" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-GET-5969f3af" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060 must be replaced
-/+ resource "aws_lambda_permission" "VotingAppApi_api_permission-POST-53dc1f64_98751060" {
      ~ function_name       = "post_requestChoices_-0-c8d86128" -> "post_requestChoices0-c8820ba5" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-POST-53dc1f64" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6 must be replaced
-/+ resource "aws_lambda_permission" "VotingAppApi_api_permission-POST-57590acc_3E83C8F6" {
      ~ function_name       = "post_selectWinner_-0-c8c0c66e" -> "post_selectWinner0-c8d65bd1" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-POST-57590acc" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355 will be created
  + resource "aws_s3_bucket" "cloudWebsite_WebsiteBucket_EB03D355" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "cloud-website-c8e58765-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE will be created
  + resource "aws_s3_bucket_policy" "cloudWebsite_DistributionS3BucketPolicy_32B029AE" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41 will be created
  + resource "aws_s3_bucket_website_configuration" "cloudWebsite_BucketWebsiteConfiguration_920E8E41" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ acl                    = "private" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "eabd0886d1f8e9b583efdafe40e1d35a" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.75b1a0086b203b3eeefa52f71b072b2e.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.75b1a0086b203b3eeefa52f71b072b2e.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.de1c9ef4a8375c74503133a258fbbc2c.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/87634971D949F1E5EA6E414C6C13B6EE/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/C8309BBCA83A3B07856BAA92CA998A16/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9 will be created
  + resource "aws_s3_object" "VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9" {
      + acl                    = (known after apply)
      + bucket                 = "code-c84a50b1-20230727202411678600000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.cbdae05830bb4c50d77748d4afa6a2a0.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_get_leaderboard0_Asset_7C98D66C/C714E654B520B0A6CCF10726F82C4E72/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_get_leaderboard_0_S3Object_04562587 will be destroyed
  # (because aws_s3_object.VotingAppApi_get_leaderboard_0_S3Object_04562587 is not in configuration)
  - resource "aws_s3_object" "VotingAppApi_get_leaderboard_0_S3Object_04562587" {
      - acl                    = "private" -> null
      - bucket                 = "code-c84a50b1-20230727202411678600000003" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "3eb88f9c81cc88220e243dda86737fae" -> null
      - force_destroy          = false -> null
      - id                     = "asset.c8adc0c6029160df0b12001870df80f2fc8316f4b9.e4dfec769bcf7b35020cea6414eda1d5.zip" -> null
      - key                    = "asset.c8adc0c6029160df0b12001870df80f2fc8316f4b9.e4dfec769bcf7b35020cea6414eda1d5.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "assets/VotingAppApi_get_leaderboard_0_Asset_8918496E/DC45CAECAEF0EEB5AF0ED6385F17BE77/archive.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.VotingAppApi_post_requestChoices0_S3Object_E5911DA4 will be created
  + resource "aws_s3_object" "VotingAppApi_post_requestChoices0_S3Object_E5911DA4" {
      + acl                    = (known after apply)
      + bucket                 = "code-c84a50b1-20230727202411678600000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.9f0731f99fca5fec261b707cf3c3bc94.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_post_requestChoices0_Asset_D5F3DEE4/C9416667A0D876D4CD9D56D68C867E7B/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_post_requestChoices_0_S3Object_0F32C7ED will be destroyed
  # (because aws_s3_object.VotingAppApi_post_requestChoices_0_S3Object_0F32C7ED is not in configuration)
  - resource "aws_s3_object" "VotingAppApi_post_requestChoices_0_S3Object_0F32C7ED" {
      - acl                    = "private" -> null
      - bucket                 = "code-c84a50b1-20230727202411678600000003" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "44113bdbb5f518755d81079e365b8581" -> null
      - force_destroy          = false -> null
      - id                     = "asset.c8d86128c81e505aae639175f68a6fc452d15dc1e7.63cd2da98675ab88eaacc9220ad7a5e6.zip" -> null
      - key                    = "asset.c8d86128c81e505aae639175f68a6fc452d15dc1e7.63cd2da98675ab88eaacc9220ad7a5e6.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "assets/VotingAppApi_post_requestChoices_0_Asset_341BDC21/70356774427B27C48E91EDDAE88B6A6B/archive.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.VotingAppApi_post_selectWinner0_S3Object_3DCD8E80 will be created
  + resource "aws_s3_object" "VotingAppApi_post_selectWinner0_S3Object_3DCD8E80" {
      + acl                    = (known after apply)
      + bucket                 = "code-c84a50b1-20230727202411678600000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.5a54d5293600dc4646c5c7852f7636a3.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_post_selectWinner0_Asset_C0113166/C09AD5FF24538D5148EC36CE6101C210/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.VotingAppApi_post_selectWinner_0_S3Object_877CE186 will be destroyed
  # (because aws_s3_object.VotingAppApi_post_selectWinner_0_S3Object_877CE186 is not in configuration)
  - resource "aws_s3_object" "VotingAppApi_post_selectWinner_0_S3Object_877CE186" {
      - acl                    = "private" -> null
      - bucket                 = "code-c84a50b1-20230727202411678600000003" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "17e46610ebb7079d0cd7770175dbc167" -> null
      - force_destroy          = false -> null
      - id                     = "asset.c8c0c66e379f219d8dcc336e3745cb403950d3def2.3ec2ec6d5f3bdba3150185cee1d1cfda.zip" -> null
      - key                    = "asset.c8c0c66e379f219d8dcc336e3745cb403950d3def2.3ec2ec6d5f3bdba3150185cee1d1cfda.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "assets/VotingAppApi_post_selectWinner_0_Asset_7CCC0FDD/32F867E1434A7E0E1000E4E3E7422610/archive.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70 will be created
  + resource "aws_s3_object" "cloudWebsite_File--asset-manifestjson_8187FE70" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/asset-manifest.json"
      + source_hash            = "52f5109f32b873252767713d89269205"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--faviconico_A86052F9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--faviconico_A86052F9" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/favicon.ico"
      + source_hash            = "c92b85a5b907c70211f4ec25e29a8c4a"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C will be created
  + resource "aws_s3_object" "cloudWebsite_File--indexhtml_2A2AE13C" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/index.html"
      + source_hash            = "4e239ba18344df91ab374d4d3c11c146"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo192png_6E513B20 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo192png_6E513B20" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo192.png"
      + source_hash            = "33dbdd0177549353eeeb785d02c294af"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo512png_E26C5AA3" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo512.png"
      + source_hash            = "917515db74ea8d1aee6a246cfbcc0b45"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--manifestjson_5AC33197 will be created
  + resource "aws_s3_object" "cloudWebsite_File--manifestjson_5AC33197" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/manifest.json"
      + source_hash            = "d9d975cebe2ec20b6c652e1e4c12ccf0"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--robotstxt_F93900E9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--robotstxt_F93900E9" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/robots.txt"
      + source_hash            = "fa1ded1ed7c11438a9b0385b1e112850"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--mainbc8dc0a9css_ABAEC285" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.bc8dc0a9.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.bc8dc0a9.css"
      + source_hash            = "54ec4ff3369108e3623984a09700699f"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--mainbc8dc0a9cssmap_D475E55B" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.bc8dc0a9.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.bc8dc0a9.css.map"
      + source_hash            = "d904f7a427a1856c82da69353e402c81"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js"
      + source_hash            = "7e5ef725749e7fbe0082ba21eb2572ef"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js.map"
      + source_hash            = "312c0eedefe8c3be0e90be0bc727cc9e"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80jsLICENSEtxt_E95A10E1" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js.LICENSE.txt"
      + source_hash            = "8dffae291722641df11b29bdf4b1f953"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80js_5A79BA2F" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js"
      + source_hash            = "899b9e12808849cf665476ecf28c771d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf35fcf80jsmap_8EB0B4F9" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f35fcf80.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f35fcf80.js.map"
      + source_hash            = "dc25a1be84198ff9fd061bdede4defa4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File-configjson_591A81BA will be created
  + resource "aws_s3_object" "cloudWebsite_File-configjson_591A81BA" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = jsonencode(
            {
              + apiUrl = "https://f9yi5t9zj2.execute-api.us-east-1.amazonaws.com/prod"
            }
        )
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "config.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 43 to add, 4 to change, 23 to destroy.

Changes to Outputs:
  ~ cloudWebsite_Endpoint_Url_31589343 = "https://d150bm8l5c4qqp.cloudfront.net" -> (known after apply)

```

</details>
